config/tasks/mutants/reader-case-insensitive-recall/m1-partial-session-site.patch
diff --git a/src/thalamus/substrate/reader.py b/src/thalamus/substrate/reader.py
index d560a51..3c3d13b 100644
--- a/src/thalamus/substrate/reader.py
+++ b/src/thalamus/substrate/reader.py
@@ -204,7 +204,7 @@ def recall(
             g.V()
             .has_label("Session")
             .has("scope", scope)
-            .has("summary", _keyword_predicate(keyword))
+            .has("summary", TextP.containing(keyword))
             .value_map("session_id")
             .to_list()
         )
