config/tasks/mutants/reader-case-insensitive-recall/m3-floor-lowered.patch
diff --git a/src/thalamus/substrate/reader.py b/src/thalamus/substrate/reader.py
index d560a51..1fb9c76 100644
--- a/src/thalamus/substrate/reader.py
+++ b/src/thalamus/substrate/reader.py
@@ -248,7 +248,7 @@ def recall(
     # were then ignored at ~3K tokens a recall (lab/006, lab/007) — a multi-keyword
     # query must hit at least two distinct terms to rank. Single-keyword queries are
     # untouched: the floor is about queries whose breadth outruns their intent.
-    floor = min(2, len(keywords))
+    floor = 1
     sessions_ranked = sorted(
         (
             item
