config/tasks/mutants/reader-case-insensitive-recall/m4-stopword-fallback-dropped.patch
diff --git a/src/thalamus/substrate/reader.py b/src/thalamus/substrate/reader.py
index d560a51..26746ab 100644
--- a/src/thalamus/substrate/reader.py
+++ b/src/thalamus/substrate/reader.py
@@ -190,7 +190,7 @@ def recall(
     """
     keywords = _extract_keywords(query)
     if not keywords:
-        return recall_recent(g, limit, scope)
+        return []
 
     claim_scopes = [scope, *(s for s in knowledge_scopes or [] if s != scope)]
 
