config/tasks/mutants/reader-case-insensitive-recall/m5-equivalent-renamed-helper.patch
diff --git a/src/thalamus/substrate/reader.py b/src/thalamus/substrate/reader.py
index d560a51..006716e 100644
--- a/src/thalamus/substrate/reader.py
+++ b/src/thalamus/substrate/reader.py
@@ -204,7 +204,7 @@ def recall(
             g.V()
             .has_label("Session")
             .has("scope", scope)
-            .has("summary", _keyword_predicate(keyword))
+            .has("summary", _ci_contains(keyword))
             .value_map("session_id")
             .to_list()
         )
@@ -217,7 +217,7 @@ def recall(
             g.V()
             .has_label("Claim")
             .has("scope", scope)
-            .has("description", _keyword_predicate(keyword))
+            .has("description", _ci_contains(keyword))
             .in_e("CONTAINS")
             .out_v()
             .has_label("Session")
@@ -233,7 +233,7 @@ def recall(
             g.V()
             .has_label("Claim")
             .has("scope", P.within(claim_scopes))
-            .has("description", _keyword_predicate(keyword))
+            .has("description", _ci_contains(keyword))
             .not_(__.in_e("CONTAINS"))
             .id_()
             .to_list()
@@ -668,7 +668,7 @@ def _load_knowledge_result(g: GraphTraversalSource, claim_vid: str) -> Knowledge
     )
 
 
-def _keyword_predicate(keyword: str) -> TextP:
+def _ci_contains(keyword: str) -> TextP:
     """Case-insensitive containment for recall keywords.
 
     `_extract_keywords` lowercases, and `TextP.containing` is case-sensitive — the
@@ -677,7 +677,7 @@ def _keyword_predicate(keyword: str) -> TextP:
     use (measured 2026-07-19: 0 containing hits vs 4 case-insensitive on the
     judge-survey claims).
     """
-    return TextP.regex("(?i)" + re.escape(keyword))
+    return TextP.regex("(?i)(?:" + re.escape(keyword) + ")")
 
 
 def _extract_keywords(query: str) -> list[str]:
